config.org
#+TITLE: Doom Emacs Config
#+AUTHOR: David Conner
#+DESCRIPTION: Inspired by the personal Doom Emacs config of DT, HaoZeke and others
#+PROPERTY: header-args :tangle ./config.el
#+STARTUP: content
#+OPTIONS: toc:nil

* About this file

This is an Emacs literate config, drawing inspiration from the following configs
below. It's definitely a work in progress and the build will probably break for
every other SHA. There's a list of much better configs in the org footnotes at
the end of the doc.

+ [[https://github.com/gilbertw1/emacs-literate-starter/][gilbertw1/emacs-literate-starter]]
+ [[https://github.com/HaoZeke/dotDoom][HaoZeke/dotDoom]]
+ And others

** Please excuse the mess

I'm spending a lot of time sampling the space of available options & developing
some familiarity with elisp. I've been through this before, and I don't want to
regret missing out on all the "unknown unknown" tools & workflow approaches. I'm
starting with a sparse sample of the entire space to avoid missing global
minimums or to avoid totally biased exploration in a small subset of dimensions.
It's like "stochastic gradient descent" or building a sparse understanding of
the hyperplane for an infinite-dimensional problem (like a kernel method)...

I hope to move on to projects in other languages soon, but for now things are a
mess. The errant TODO statements will be thinned out soon enough.

** Approach to TOC

The TOC is loosely based on the Doom Emacs categories to make it simpler for
others to grok the structure and simpler for me to organize. The TOC headings
are generated with =toc-org= by specifying a heading including the tag:
=:TOC_3_gh:=.

** Tangle Output

Add the ~doom-emacs~ metadata comments to tangle exports:

#+BEGIN_SRC emacs-lisp
;; -*- no-byte-compile: t; lexical-binding: t; -*-
;;; ~/.doom.d/config.el
(setq user-full-name "David Conner"
      user-mail-address "noreply@te.xel.io")
#+END_SRC

When specified by =:tangle=, export the =(package! ...)= declarations to =packages.el=.

#+BEGIN_SRC emacs-lisp :tangle ./packages.el
;; -*- no-byte-compile: t; lexical-binding: t; -*-
;;; ~/.doom.d/packages.el
#+END_SRC

There may be other babel source blocks. Eventually, I would like include some
elisp code for reflecting on Doom Emacs (e.g. extracting a list of packages
added by Doom modules).

**** TODO place light semantic-versioning constraints on packages
+ ~(package asdfoo-bar :pin 1234)~

**** TODO performance adjustments
+ follow advice in [[file:~/.emacs.d/docs/faq.org::*How does Doom start up so quickly?][Doom FAQ]]
+ figureout what's keeping this in custom.el ~'(auth-source-save-behavior nil)~

* Table of Contents :TOC_3_gh:
- [[#about-this-file][About this file]]
  - [[#please-excuse-the-mess][Please excuse the mess]]
  - [[#approach-to-toc][Approach to TOC]]
  - [[#tangle-output][Tangle Output]]
- [[#configel][Config.el]]
  - [[#input][INPUT]]
    - [[#keyboard][Keyboard]]
    - [[#point-movement][Point Movement]]
    - [[#lispy][Lispy]]
    - [[#mouse][Mouse]]
  - [[#completion][COMPLETION]]
    - [[#completion-prompts][Completion prompts]]
    - [[#company][Company]]
    - [[#ivy][IVY]]
  - [[#ui][UI]]
    - [[#doom-theme][Doom Theme]]
    - [[#font][Font]]
    - [[#ligatures][Ligatures]]
    - [[#indent-guides][Indent Guides]]
    - [[#window-ui][Window UI]]
    - [[#menu-bar][Menu Bar]]
    - [[#highlighting][Highlighting]]
    - [[#startup][Startup]]
    - [[#all-the-icons][All The Icons]]
    - [[#treemacs][Treemacs]]
    - [[#which-key][which-key]]
    - [[#modeline][Modeline]]
    - [[#dimmer][Dimmer]]
    - [[#window--frame-management][Window & Frame Management]]
    - [[#misc][Misc]]
  - [[#editor][EDITOR]]
    - [[#centered-cursor-mode][Centered Cursor Mode]]
    - [[#snippets][Snippets]]
  - [[#emacs][EMACS]]
    - [[#dired][DIRED]]
  - [[#term][TERM]]
    - [[#shell][Shell]]
  - [[#checkers][CHECKERS]]
  - [[#tools][TOOLS]]
    - [[#lookup][Lookup]]
    - [[#info][Info]]
    - [[#diff-and-ediff][Diff and Ediff]]
    - [[#git][Git]]
    - [[#magit][Magit]]
    - [[#forge][Forge]]
    - [[#github][Github]]
    - [[#shell-1][Shell]]
    - [[#archlinux][Archlinux]]
    - [[#ken-kesey][Ken Kesey]]
    - [[#docker][Docker]]
    - [[#kubernetes][Kubernetes]]
    - [[#saltstack][SaltStack]]
    - [[#ast--metaprogramming][AST & Metaprogramming]]
    - [[#lsp-mode][LSP Mode]]
    - [[#lsp-ui][LSP UI]]
    - [[#packages-to-evaluate-tools][Packages to Evaluate (Tools)]]
  - [[#os][OS]]
  - [[#org][ORG]]
    - [[#keys][Keys]]
    - [[#org-literate][Org Literate]]
    - [[#org-directory][Org Directory]]
    - [[#org-agenda][Org Agenda]]
    - [[#org-capture][Org Capture]]
    - [[#source-blocks][Source Blocks]]
    - [[#packages-to-evaluate-org][Packages to Evaluate (Org)]]
  - [[#lang][LANG]]
    - [[#elisp][ELISP]]
    - [[#latex][LATEX]]
    - [[#clojure][CLOJURE]]
    - [[#cider][CIDER]]
    - [[#julia][JULIA]]
    - [[#plantuml][PLANTUML]]
    - [[#kde][KDE]]
    - [[#qt][QT]]
    - [[#c][C++]]
    - [[#open-api][OPEN API]]
    - [[#restclient][RESTCLIENT]]
    - [[#graphql][GRAPHQL]]
    - [[#packages-to-evaluate-languages][Packages to Evaluate (Languages)]]
  - [[#babel][BABEL]]
    - [[#ensure-this-is-necessary-with-org-init-babel-lazy-loader-h][ensure this is necessary with =+org-init-babel-lazy-loader-h=]]
    - [[#ob-async][ob-async]]
    - [[#ob-translate][ob-translate]]
  - [[#email][EMAIL]]
  - [[#app][APP]]
    - [[#packages-to-evaluate-app][Packages to Evaluate (App)]]
  - [[#config][CONFIG]]
    - [[#prismel][Prism.el]]
    - [[#rainbow-mode][Rainbow Mode]]
- [[#footnotes][Footnotes]]

* Config.el :doom:config:

:PROPERTIES:
:VISIBILITY: children
:END:

** INPUT :input:

[[file:~/.emacs.d/core/core-keybinds.el][.emacs.d/core/core-keybinds.el]] makes for a very useful key & map! reference

*** Keyboard :kbd:

Most of these configs should be in their individual ~*-mode~ sections or under the *:kbd:* tag

#+begin_src emacs-lisp
;; Fixes problems with dead keys
(require 'iso-transl)
#+end_src

*** Point Movement

*** Lispy :lispy:

[[https://oremacs.com/lispy/][Keymap reference]] for [[https://github.com/abo-abo/lispy][Lispy]]. "[[https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-10.html#%25_sec_1.1.5][Always be evaling]]"

#+begin_src emacs-lisp
;; TODO clojurescript hook
;; TODO this may need to be set before lispy loads....
(setq lispy-compat '(cider edebug))
#+end_src

**** TODO fix auto-formatting so that lispy's ;;** outline sytnax works without auto-format fucking it up


*** Mouse :mouse:

see [[ergoemacs.org/emacs/emacs_mouse_wheel_config.html][Xah Lee's post on Mouse Config]] for more info on the how & why

**** Misc Mouse Configs

#+begin_src emacs-lisp
(setq mouse-wheel-progressive-speed nil)
#+end_src

**** Mouse 8 and 9
:PROPERTIES:
:ID:       692e65d2-2cd3-4564-bd75-26dcc2b84251
:END:

#+begin_src emacs-lisp
;; TODO: misc subdir & project-level shortcuts (dired,project)

;; for now, simply back/forward buffer ;; TODO: change =forward= to bufler or emacs-tab bar?
(map! "S-<mouse-8>" 'previous-buffer)
;; TODO something else: (map! "S-<mouse-9>" 'next-buffer)

(map! "<mouse-8>" 'counsel-grep-or-swiper)
(map! "<mouse-9> " 'swiper-all-buffer-p)
;; (map! "C-<mouse-8>" '+ivy/switch-buffer)
;; (map! "C-<mouse-9>" '+ivy/switch-workspace-buffer)
(map! "C-S-<mouse-8>" 'projectile-find-file)
(map! "C-S-<mouse-9>" 'projectile-grep)

;; (map! "C-M-<mouse-8>" '+workspace/switch-right)
;; (map! "C-M-<mouse-9>" '+workspace/switch-right)
;; (map! "M-S-<mouse-8>" 'doom/save-session) ;; TODO: remap
;; (map! "M-S-<mouse-9>" 'doom/load-session) ;; TODO: remap
;; (map! "M-<mouse-8>" 'better-jumper-jump-backward)

;; TODO: something else (map! "M-<mouse-9>" 'better-jumper-jump-backward)
#+end_src

#+RESULTS:

**** TODO ensure that the =+workspace= references are mostly culled out
+ (so bufler can be tested)

**** TODO other mouse maps
+ and navigating =describe-= and other docs
+ helpful-at-point
+ completion-at-point
+ highlight-symbol-at-point
+ counsel-dash-at-point

**** TODO config better functionality for =mwheelscroll=
+ signature =(mwheel-scroll EVENT &optional ARG)= defined in ~emacs/28/lisp/mwheel.el~
+ =mouse-wheel-scroll-amount-horizontal= parameterizes the event

**** TODO configure more functionality for the mouse :mouse:keys:
+ [ ] navigate to function at point
+ [ ] describe function at point
+ [ ] ~(kbd "<mouse-4>")~ linux mouse wheel scroll up
+ [ ] ~(kbd "<mouse-5>")~ linux mouse wheel scroll down
+ =<fringe>= and =<modeline>=

*** Wacom :wacom:

**** Mouse 10, 11, 12
Mouse 12 is for code folding. It is the easiest on the Wacom to combine with
modkeys while toggling to/from scrolling.

For Mouse 10/11/12, all of the following modkey combinations are easy to toggle while keeping the index finger near Mouse 13 and Wheel.

+ None
+ C
+ M
+ S
+ C-M
+ C-S
+ M-S (press both with thumb)
+ C-M-S (press both with thumb)

**** Mouse 13 and VWheel

Since I want to use the wheel to scroll anyways (without hitting modkeys), I am unsure of whether I want to remap it to HWheel in the Wacom drivers.

**** Mouse 14, 15

Mouse 14 & 15 are easy to use with the following modkeys.

+ None
+ M
+ S
+ M-S

Combinations with Control are a little more difficult with one hand.

**** Origami (Mouse 12)

#+begin_src emacs-lisp
(map! "<mouse-12>" 'origami-toggle-node)
(map! "C-<mouse-12>" 'origami-open-node-recursively)
(map! "C-S-<mouse-12>" 'origami-close-node-recursively)

(map! "M-<mouse-12>" 'origami-forward-fold)
(map! "S-<mouse-12>" 'origami-backward-fold-same-level)
(map! "M-S-<mouse-12>" 'origami-forward-fold-same-level)

(map! "C-M-<mouse-12>" 'origami-close-all-nodes)
(map! "C-M-S-<mouse-12>" 'origami-open-all-nodes)

;; (map! "M-S-<mouse-12>" 'origami-show-only-node)
#+end_src

**** Mode Hints (Mouse 14)

Mouse 14 is intended to give hints for keybindings.

- =M-<mouse-14>= calls to =which-key-show-major-mode= and should not require
  specific =config.el= behavior to be defined.
- =C-<mouse-14>= is intended to evoke mode-specific hydras, but requires these
  hydras to have been defined (see [[*HYDRAS][HYDRAS]])

#+begin_src emacs-lisp
(map! "M-<mouse-14>" 'which-key-show-major-mode)
#+end_src

*** Artist Mode :artist_mode:

[[https://www.emacswiki.org/emacs/ArtistMode][HOLY SHIT]]

** COMPLETION

*** Completion prompts

**** TODO (luca) Prescient + selectrum + consult + marginalia + embark

*** Company :company:

For hotkeys, check the Doom [[file:~/.emacs.d/modules/completion/company/README.org::*Code completion][Company module]] docs (company boxes negate =C-h m=
and other help commands)

**** TODO check luca: delay/prefix, disable tab? and yasnippets in company

**** [[https://github.com/osv/company-web][company-web]] and [[https://github.com/smihica/emmet-mode][emmet-mode]]

These are included with Doom, but worth linking in.

*** IVY :ivy:

Removed =-childframe= for now, as these are actual frames, kinda.

**** HOLD configure views to use with ~ivy-switch-view~ (or just use bufler?)

** UI :uiux:

*** Doom Theme

#+begin_src emacs-lisp
(setq doom-theme 'doom-one
      doom-one-brighter-modeline t)

;; (setq doom-theme 'doom-acario-dark
;;   doom-acario-dark-brighter-comments nil
;;   doom-acario-dark-brighter-modeline t
;;   doom-acario-dark-comment-bg nil
;;   doom-acario-dark-padded-modeline 4)
#+end_src

*** Font

#+begin_src emacs-lisp
;; (set-frame-font "Source Code Pro 12" nil t)
(setq doom-font (font-spec :family "DejaVu Sans Mono" :size 14)
      doom-unicode-font (font-spec :family "DejaVu Sans Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "DejaVu Sans" :size 14)
      doom-font-increment 1)

(unless (find-font doom-font)
  (message "couldn't find 'doom-font. using a default.")
  (setq doom-font (font-spec :family "Source Code Pro" :size 18)))

(unless (find-font doom-unicode-font)
  (message "couldn't find 'doom-unicode-font. using a default.")
  (setq doom-unicode-font (font-spec :family "Source Code Pro" :size 18)))
#+end_src

+ config =doom-variable-pitch-font=?
+ config =ivy-posframe-font=

*** Ligatures

Disable extra ligatures in a few modes [fn:luca_doom]

#+BEGIN_SRC emacs-lisp
(setq +ligatures-extras-in-modes
      '(not special-mode comint-mode eshell-mode term-mode vterm-mode python-mode))
#+END_SRC

**** TODO configure [[org:/home/dc/.emacs.d/modules/ui/ligatures/README.org][+ligatures]] module

*** Indent Guides

The =indent-guides= doom module conflicts with =prism=. These must be applied to
each buffer in this order:

1. prism
2. indent-guide

**** TODO fix prism/indent-guide conflict

*** Window UI

Dividers are too thin to grab if only 1px

#+begin_src emacs-lisp
(setq window-divider-default-right-width 1)
(setq window-divider-default-bottom-width 1)
#+end_src

**** TODO automatically balance window widths?
**** TODO setup startup windows (luca)

*** Menu Bar

[[https://www.emacswiki.org/emacs/MenuBar][Menu bar]] is for noobs. I am a noob.

#+begin_src emacs-lisp
(menu-bar-mode +2)
#+end_src

i.e. CIDER alone has like 200 functions i need to learn

*** Highlighting

#+begin_src emacs-lisp :tangle ./packages.el
(package! auto-highlight-symbol)
#+end_src

#+begin_src emacs-lisp
(use-package! auto-highlight-symbol
  ;; should autoload on bind
  :config (map! (:prefix "M-s h" :desc "auto-highlight-mode"
                 "A" (lambda () (interactive) (auto-highlight-symbol-mode 'toggle)))))
#+end_src

*** Startup

**** TODO write script to generate all 64 hexagrams in SVG for random Doom startup

*** All The Icons

#+begin_src emacs-lisp :tangle ./packages.el
(package! treemacs-all-the-icons)
#+end_src

#+begin_src emacs-lisp
(use-package! treemacs-all-the-icons)

(add-hook 'doom-init-ui-hook
          (lambda () (treemacs-load-theme "Default")))
#+End_src

**** TODO (configure) All the icons
+ [ ] load treemacs theme (for all the icons?)
+ [ ] [[https://github.com/seagle0128/all-the-icons-ivy-rich][all-the-icons-ivy-rich]] (doom ivy includes ivy-rich)

*** Treemacs

Set a default width for treemacs & disable filewatch unless needed

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-width 24)
  (treemacs-filewatch-mode -1))
#+end_src

Key bindings ([[https://github.com/sei40kr/spacemacs.d/blob/master/treemacs-custom.el][treemacs example in spacemacs]])

#+begin_src emacs-lisp
(map! :map treemacs-mode-map :after treemacs
      (:prefix "o" :desc "Tags" "t" 'treemacs-toggle-node-prefer-tag-visit))
#+end_src

It is possible to make the Treemacs window draggable by default with ~(setq
treemacs--width-is-locked nil)~ on startup, which i finally figured out
(immediately before finally discovering ~(balance-windows)~ which maximizes the
treemacs width if it's not fixed.....)

*** which-key

shorten the delay (from luca)

#+BEGIN_SRC emacs-lisp
(after! which-key
    (setq which-key-idle-delay 0.5))
#+END_SRC

*** Modeline

customize [[https://github.com/seagle0128/doom-modeline][doom-modeline]]

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  ;; doom-modeline workspace-name has conflicts with bufler tab-bar
  (setq doom-modeline-workspace-name nil

        doom-modeline-height 24
        ;; doom-modeline-project-detection 'ffip,'projectile,'projectile
        doom-modeline-minor-modes t))
#+END_SRC

**** TODO configure modeline (refer to HaoZeke, luca and others)
**** TODO check out [[https://github.com/hlissner/doom-emacs-private/blob/master/lisp/modeline.el][Hlissner's modeline]] for customization ideas
**** TODO figure out error (if consistent) ~Error during redisplay: (eval (doom-modeline-segment--workspace-name)) signaled (invalid-function ((&plist :name :path) workspace))~

