config.org
*** Dimmer

#+begin_src emacs-lisp :tangle ./packages.el
(package! dimmer)
#+end_src

#+begin_src emacs-lisp
(use-package! dimmer
  :config (setq dimmer-adjustment-mode :background
                dimmer-fraction 0.4)

  (dimmer-configure-company-box)
  (dimmer-configure-magit)
  (dimmer-configure-org)
  (dimmer-configure-hydra)
  (dimmer-configure-which-key)
  (dimmer-configure-posframe))
#+end_src

*** Window & Frame Management

Use burly for bookmarking loaded window configurations. This should perhaps be a
=+burly= feature on the =workspace= module, with perhaps alternate ~(:when (feature! :ui workspace +burly))~
workspaces

#+begin_src emacs-lisp :tangle ./packages.el
(package! burly)
#+end_src

These are simply bookmarks and thus can be reached from the doom startup menu.

#+begin_src emacs-lisp
(use-package! burly
  :config (map! :leader
                (:prefix ("w" . "workspaces/windows")
                  (:prefix ("B" . "Burly bookmarks")
                   :desc "Restore windows/frames" "o" #'burly-open-bookmark
                   :desc "Open Burly URL" "O" #'burly-open-url
                   :desc "Bookmark Windows" "w" #'burly-bookmark-windows
                   :desc "Bookmark Frameset" "f" #'burly-bookmark-frames
                   :desc "Copy Buffer URL" "B" #'burly-kill-buffer-url
                   :desc "Copy Window URL" "F" #'burly-kill-frames-url
                   :desc "Copy Frameset URL" "W" #'burly-kill-windows-url))))
#+end_src

**** TODO helpers for manageing Burly URL's copied to the kill ring
**** TODO doom emacs is missing the delete-bookmark binding for non-evil users

*** Misc

This determines the style of line numbers. For relative line numbers, set this
to `relative'.

#+begin_src emacs-lisp
(setq display-line-numbers-type nil)
#+end_src

**** TODO configure nav-flash (like in spacemacs)

** EDITOR :editor:

**** TODO consider auto-save-default

*** Centered Cursor Mode

Scroll lock can emulate this.

#+begin_src emacs-lisp :tangle ./packages.el
(package! centered-cursor-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! centered-cursor-mode ;: defer t
  :config (map! :leader :desc "Toggle Centered Cursor"
                "t-" (λ! () (interactive) (centered-cursor-mode 'toggle))))
#+end_src

*** Snippets

**** TODO Consider [[https://github.com/ymarco/auto-activating-snippets][aas]] and [[https://github.com/tecosaur/LaTeX-auto-activating-snippets][laas]]

More-performant approach to auto-expanding snippets

**** Yasnippet-snippets

*** TODO COMMENT set yas-snippet-dirs

#+begin_src emacs-lisp
(setq dc/snippets (expand-file-name (concat doom-private-dir "snippets")))

(eval-after-load 'yasnippet
  (lambda ()
    (add-to-list 'yas-snippet-dirs 'dc/snippets)
    (message "loading snippets")
    (message dc/snippets)
    (yas-load-directory dc/snippets t)))
#+end_src

***** TODO do i really want to blindly import all fo these?

**** TODO org-babel snippet for splitting =./packages.el= and =./config.el=

** EMACS :emacs:

*** AUTH

#+BEGIN_SRC emacs-lisp
;; (setq auth-sources '("~/.authinfo" "~/.authinfo.gpg" "~/.netrc"))
(setq auth-sources (append `(,(concat (file-name-as-directory (getenv "DF_")) ".ectorepo.gpg")) auth-sources))
#+END_SRC

*** DIRED

Remove `.` and `..` from list of omitted file patterns (so i can always run
commands on the directory). Also `M-!` will run commands on the dir without
parameterizing a subdir.

#+begin_src emacs-lisp
(setq dired-omit-files "^.DS_Store\\'\\|^.project\\(?:ile\\)?\\'\\|^.\\(svn\\|git\\)\\'\\|^.ccls-cache\\'\\|\\(?:\\.js\\)?\\.meta\\'\\|\\.\\(?:elc\\|o\\|pyo\\|swp\\|class\\)\\'")
#+end_src

**** TODO configure [[https://github.com/xahlee/xah-dired][Xah Dired]] package & keys
+ full of helpers for working with images in dired.
+ need to check Xah's init files for hotkeys

** TERM :term:

*** Shell

**** Explicit Shell

This fixes an issue i'm having where ~/bin/fish~ is the default shell no matter
how i've configured things with ~chsh~. This was done by Garuda/Arch either
before or after the doom/emacs install.

#+begin_src emacs-lisp
(setq explicit-shell-file-name "/bin/zsh")
#+end_src

**** TODO check luca shell configs


** CHECKERS :checkers:

** TOOLS :tools:

*** Lookup :lookup:

**** TODO configure docsets for =counsel-dash=
+ [ ] find path to zeal docs
**** TODO configure =+dictionary= flag
**** TODO configure =+docset= flag functionality
***** [ ] clojure docsets
***** [ ] julia docsets
***** [ ] c++ docsets

[[https://github.com/daviwil/dotcrafter.el/][Dotcrafter]] helps you craft your dotfiles.

**** TODO why the fuck does this keep fucking up?

This gets de/tangled as the firestarter block, but the firestarter block doesnt

#+begin_example
#+begin_src emacs-lisp :tangle ./config.el
;;(use-package! firestarter
;;  :init (firestarter-mode)
;;  :config (setq firestarter-default-type t))
#+end_src
#+end_example

#+begin_src emacs-lisp
;; (use-package! dotcrafter
;;   :custom
;;   (dotcrafter-dotfiles-folder (getenv "DF_"))
;;   (dotcrafter-org-files '("zsh/README.org"
;;                           "input/README.org"
;;                           "clojure.org")))
#+end_src

*** Info

#+begin_src emacs-lisp :tangle ./packages.el
(package! info-colors)
#+end_src

test with emacs manual =C-h R=

#+begin_src emacs-lisp
(use-package! info-colors)
#+end_src

**** TODO test =info-colors= or modularize

*** Diff and Ediff

+ [ ] flycheck-checkpatch
+ [ ] ztree (recursive diff tool)



**** ediff
***** TODO configure ediff for patching nvidia driver source/headers

*** Git
+ [X] git-gutter (doom)
+ [X] git-gitter-fringe
+ [ ] [[https://github.com/10sr/git-walktree-el][git-walktree]]
+ [ ] git-blamed
+ [ ] git-messenger (check performance)
+ [X] *git-timemachine* (doom)
+ [ ] gitolite-clone
+ [ ] borg (assimilate emacs packages as git submodules)

*** Magit
+ [ ] *magit-forge*
+ [ ] magit-delta
+ [ ] magit-todos or magit-org-todos
+ [ ] orgit (org links to magit buffers)
+ [ ] magit-gitflow
+ [ ] magit-gh-pulls
+ [ ] magit-popup


[[https://github.com/magit/magit-tbdiff][magit-tbdiff]] show diffs over ranges of commits

#+begin_src emacs-lisp :tangle ./packages.el
(package! magit-tbdiff)
#+end_src

#+begin_src emacs-lisp
(use-package! magit-tbdiff)
#+end_src

**** TODO: configure =magit-repository-directories=
+ see =hlissner= config & others

*** Forge
+ [ ] forge (also integrates with magit)
+ [ ] orgit-forge

*** Github
+ [ ] github-explorer
+ [ ] *github-pullrequest*
+ [ ] *github-search*
+ [ ] *github-stars*
+ [ ] github-clone
+ [ ] *magithub*
+ [ ] *org2issue*
+ [X] *treemacs-magit*

*** Shell

[[https://depp.brause.cc/firestarter][Firestarter]] enables =./.dir-local.el= variables and file-local declarations to
config/control on-save shell tasks.[fn:haozeke]

#+begin_src emacs-lisp :tangle ./packages.el
(package! firestarter)
#+end_src

#+begin_src emacs-lisp
(use-package! firestarter
  :init (firestarter-mode)
  :config (setq firestarter-default-type t))
#+end_src

*** Archlinux

**** PKGBUILD Mode

#+BEGIN_SRC emacs-lisp :tangle ./packages.el
(package! pkgbuild-mode
  :recipe (:host github :repo "juergenhoetzel/pkgbuild-mode"))
#+END_SRC

#+begin_src emacs-lisp
(use-package! pkgbuild-mode :mode "\\PKGBUILD")
#+end_src

**** Crontab Mode

[[0    Link: https://github.com/emacs-pe/crontab-mode][crontab-mode]]

#+begin_src emacs-lisp :tangle ./packages.el
(package! crontab-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! crontab-mode)
#+end_src

***** TODO test crontab-mode :testpackage:

*** Ken Kesey

[[https://github.com/jhgorrell/ssh-config-mode-el][ssh-config-mode]] and [[https://github.com/jobbflykt/x509-mode][x509-mode]]

#+begin_src emacs-lisp :tangle ./packages.el
(package! ssh-config-mode)
(package! x509-mode)
;; TODO ssh-agency
;; TODO ssh-tunnels
#+end_src

For =ssh-config-mode= add this file-local variable to configs =# -*- mode:
ssh-config -*-=

#+begin_src emacs-lisp
(use-package! ssh-config-mode)
(use-package! x509-mode)
#+end_src

+ [ ] ssh-agency
+ [ ] ssh-tunnels (hmmmm)

*** Docker

To use what the Doom module configures, install =docker=, =docker-compose= and =docker-machine=. for

The [[file:~/.emacs.d/modules/tools/docker/config.el][doom config file]] looks a little sparse, so the config must be partially
composed in and installed in other module config.el files. Actually, now that I
checked, most of the =docker*= features are being loaded into emacs with some
(e.g. docker-compose-*) being loaded as needed.

#+begin_src emacs-lisp
(use-package! docker
  :config (setq docker-run-as-root t
                docker-image-run-arguments '("-i" "-t" "--rm")))

;; so the ## -*- docker-image-name: "image-name" -*- directive works with ~dockerfile-mode~
;; TODO assess
(put 'dockerfile-image-name 'safe-local-variable #'stringp)
#+end_src

**** [[https://github.com/emacs-lsp/lsp-docker][LSP Docker]] (requires pulling =emacslsp/lsp-docker-full= image)

This sets up LSP servers running on Docker containrs with more tightly
controlled configuration. e.g. when you want:
+ faster startup times
+ servers tuned a specific set of large projects
+ repeatable/declarative LSP configuration
+ to share cache or control its persistence for large projects

(not really sure how this works with branching or git worktrees)

***** TODO configure lsp-docker
+ probably when i'm working on Krita

**** TODO setup =C-c d= as a "devops" prefix, remap =C-c d d= to =docker=

*** Kubernetes

**** TODO setup kubernetes.el :doom:devops:packages:
**** TODO evaluate ~kubectl~ package :doom:devops:packages:

**** Kubernetes
+ [ ] kubernetes.el
+ [ ] [[https://github.com/gruggiero/kubernetes-tramp][kubernetes-tramp]]
+ [ ] [[https://github.com/TxGVNN/emacs-k8s-mode][k8s-mode]] (kubernetes file support + snippets)

*** SaltStack

From HaoZeke[fn:haozeke]

#+begin_src emacs-lisp :tangle ./packages.el
(package! salt-mode)
#+end_src

#+begin_src emacs-lisp
(use-package salt-mode)
#+end_src

**** TODO Need to check config


*** AST & Metaprogramming

+ [ ] [[https://github.com/ubolonton/emacs-tree-sitter][tree-sitter-mode]]
  - install packages
  - add config
  - document setup
  - consider setting up as a module
+ [ ] [[https://github.com/countvajhula/symex.el][symex]]

**** TODO configure bindings & control when these are activated

*** LSP Mode

**** TODO work out lsp/eldoc interactions

*** LSP UI

#+begin_src emacs-lisp
(setq lsp-ui-peek-list-width 25
      ;; lsp-ui-sideline--last-width

      ;; TODO ensure these are necessary/useful
      lsp-ui-doc-max-width 35 ;; 35 is default
      ;; lsp-ui-doc--inline-width

      lsp-ui-imenu-window-width 25)
#+end_src

*** Packages to Evaluate (Tools)

**** Diff & Patch
+ [ ] vdiff & vdiff-magit (does it do patches?)

**** Fast file find
+ [ ] [[https://github.com/technomancy/find-file-in-project][find-file-in-project]]
+ [ ] [[https://github.com/h/find-file-in-repository][find-file-in-repository]]

**** Docker
+ [ ] SLIME Docker
+ [X] [[https://github.com/emacs-pe/docker-tramp.el][docker-tramp]] (2017) included with doom (configured?)
+ [ ] [[https://github.com/bosko/docker-cli][docker-cqli]]

**** Devops
+ [ ] [[https://github.com/cjohansson/emacs-ssh-deploy][ssh-deploy]] (deployment via tramp)
+ projectile shell mgmt
  - [ ] term-projectile (projectile + tmux, more or less)
  - [ ] [[https://github.com/waymondo/projector.el][projector]] (projectile-based management of shells & their buffers)
+ [ ] systemd

**** Logging
+ [ ] logito (emacs logging)

**** Tramp
+ [ ] [[https://github.com/randymorris/tramp-term.el][tramp-term]]
+ [ ] [[https://github.com/oitofelix/tramp-auto-auth][tramp-auth-auth]]

**** Debugging
+ [ ] asm-mode, gas-mode

**** LSP
+ [ ] [[https://github.com/joaotavora/eglot][eglot]] (management/automation for LSP servers) + [[https://github.com/non-Jedi/eglot-jl][eglot-jl]]
  - just going with LSP for now, at least until eglot matures.

**** Docs
+ [ ] [[https://github.com/dkogan/xcscope.el][xcscope.el]] for large java/c/c++ projects
  - emacs interface to =cscope=, searches codebase for references/etc

** OS :os:

** ORG :org:

*** Keys :kbdmaps:

**** TODO remap ~org-forward-heading-same-level~
+ ~C-c C-b~ maps to ~org-backward-heading-same-level~
+ ~C-c C-f~ conflicts with code folding (which does nothing in org/babel)

*** Org Directory

#+begin_src emacs-lisp
(setq org-directory (getenv "ORG_DIRECTORY")
      +org-capture-journal-file (concat (file-name-as-directory org-directory) "journal.org")
      org-calendars-directory (concat  (file-name-as-directory org-directory) "calendars"))
#+end_src

*** Org Literate

prevent over-eager dotfiles recompilation =from HaoZeke=

#+BEGIN_SRC emacs-lisp
(after! org
  (remove-hook 'after-save-hook #'+literate|recompile-maybe))
#+END_SRC


#+begin_example
#+begin_src emacs-lisp :tangle no
(defun dc/util--paths-from-alist (paths-alist)
  "reduce an alist of paths, where the keys are directories and the
values are lists of files, to produce a list of files with
absolute paths  "
  (let* ((path-keys (mapcar 'car paths-alist))
        (root-paths (mapcar 'file-name-as-directory path-keys))
        ;; (root-paths (map 'file-name-as-directory path-keys))
                                        ;        (absolute-paths )
                                        ;       (mapcar (lambda (file) (concat (filename-as-directory ))))
        )

    root-paths
    ;; path-keys

))




;; map-values-apply concat

(let ((agenda-map '((org-directory . '("todo.org" "notes.org" "habits.org" "projects.org"))
                    (doom-private-dir . '("todo.org" "notes.org"))))


      )
(dc/util--paths-from-alist agenda-map)
        )



;; (setq org-agenda-files  )


        ;;      (let ((agenda-root ) ) ) (mapcar (lambda (f) (concat (filename-as-directory (or (getenv "ORG_AGENDA_ROOT")
        ;; (getenv "ORG_DIRECTORY"))) f)))
#+end_src
#+end_example

