packages.el

(package! centered-cursor-mode)

(package! magit-tbdiff)

(package! firestarter)

(package! pkgbuild-mode
  :recipe (:host github :repo "juergenhoetzel/pkgbuild-mode"))

(package! ssh-config-mode)
(package! x509-mode)
;; TODO ssh-agency
;; TODO ssh-tunnels

(package! salt-mode)
