config.org
*** Org Agenda

#+begin_src emacs-lisp
(after! org
  (setq org-log-done 'time
        org-support-shift-select t
        ;;org-agenda-files (concat (file-name-as-directory org-directory) "agenda.org")
        ;; TODO include content from Adam James
        ))

This configures org-roam v2 and is not compatible with doom's org-roam module. See the updated Hitchiker's Guide for more info. As long as one bears in mind the differences between v1 and v2, then these links are also useful

#+begin_src emacs-lisp
;; encapsulate org-roam-directory within (file-truename ___) if using links
(setq org-roam-directory (concat (file-name-as-directory org-directory) "roam")
      org-roam-db-location (concat (file-name-as-directory org-roam-directory) "org-roam.db")
      org-roam-file-extensions '("org")
      org-roam-dailies-directory "dailies/"
      org-roam-dailies-capture-templates
      '(("d" "default" entry
         "* %?"
         :if-new (file+head "%<%Y-%m-%d>.org"
                            "#+title: %<%Y-%m-%d>\n")))
      org-roam-mode-sections (list #'org-roam-backlinks-section
                                   #'org-roam-reflinks-section
                                   ;; generating unlinked can be slow
                                   ;; #'org-roam-unlinked-references-section
                                   ))

(use-package! org-roam
  :after org
  :commands
  (org-roam-buffer
   org-roam-setup
   org-roam-capture
   org-roam-node-find)
  :config
  (org-roam-setup))

(use-package! org-roam-protocol
  :after org-protocol)

;; from https://org-roam.discourse.group/t/org-roam-major-redesign/1198/220
;;(setq org-roam-node-display-template "${title:80}  ${file:9} ${tags:20}")
#+end_src

#+RESULTS:

Current =org-journal= mappings

+ C-c n j j :: =org-journal-new-entry=
+ C-c n j s :: =org-journal-search-forever=
+ C-c n j j :: =org-journal-new-scheduled-entry=


*** Capture

**** TODO capture template for code examples
- set the possible refile locations according to configured metarepos

*** Refile

#+begin_src emacs-lisp
(setq org-refile-targets
      '((org-agenda-files . (:maxlevel . 3))
        (nil . (:maxlevel . 3)))

      org-refile-use-outline-path t
      org-refile-allow-creating-parent-nodes 'confirm
      org-refile-use-cache t)

(unless (boundp 'org-refile-cache-timer)
  (run-with-idle-timer 300 t (lambda ()
                               (org-refile-cache-clear)
                               (org-refile-get-targets)))
  (setq org-refile-cache-timer t))

;; TODO consider using =org-refile-target-verify-function
;; to filter subtrees marked "done" from being org-refile-targets
;; (source: mwfogleman/englehorn)
#+end_src

*** Agenda

+ protesilaos & hsinhaoyu have pretty comprehensive configs

*** Clock

Set auto-clockout to keep time tracking accurate. Refer to [[https://orgmode.org/manual/Clocking-Work-Time.html#Clocking-Work-Time][Orgmode Manual entry]] for details.

#+begin_src emacs-lisp
(setq org-clock-auto-clockout-timer 300
      ;; org-clock-idle-time 3
        )
(org-clock-auto-clockout-insinuate)
#+end_src

*** Super Agenda

+ review mwfogleman's config

#+begin_src emacs-lisp
(use-package! org-super-agenda
  :init (setq org-super-agenda-groups
                '((:name "Today"
                   :time-grid t
                   :todo "Today")
                  (:habit t)
                  (:name "Due today"
                   :deadline today)
                  (:name "Overdue"
                   :deadline past)
                  (:name "Due soon"
                   :deadline future)
                  (:name "Important"
                   :priority "A")
                  (:priority<= "B"
                   :order 1)
                  ))
  :config (org-super-agenda-mode))
#+end_src

*** org-ql

#+begin_src emacs-lisp

#+end_src

*** Org Capture

**** TODO luca capture templates (thoughts for day)

*** Source Blocks

Don't indent content in source blocks

#+begin_src emacs-lisp
(setq org-edit-src-content-indentation 0)
#+end_src

*** Packages to Evaluate (Org)

**** Org
+ akirak
  - [ ] [[https://github.com/akirak/org-starter][org-starter]] (good orgmode presets & asset creation tools?),
  - [ ] [[https://github.com/akirak/ivy-omni-org][ivy-omni-org]] (fast org buffer access)
  - [ ] [[https://github.com/akirak/org-reverse-datetree][org-reverse-datetree]] (do i already have this?)
+ mtekman
  - [ ] [[https://gitlab.com/mtekman/org-treeusage.el][org-treeusage]]
  - [ ] [[https://gitlab.com/mtekman/org-tanglesync.el][org-tanglesync]]
  - [ ] [[https://gitlab.com/mtekman/remind-bindings.el][remind-bindings.el]]
  - [ ] wiki-summary.el
  - [ ] [[https://gitlab.com/mtekman/wiki-drill.el][wiki-drill.el]]
  - [ ] [[https://gitlab.com/mtekman/org-mode-manager][org-mode-manager]] (cmd-line tool)
+ [X] org-bullets vs org-fancy-priorities =+pretty=
+ [ ] org-appear (easier editing of org markup)
+ [ ] [[https://github.com/kidd/org-gcal.el][org-gcal]] or [[https://github.com/dengste/org-caldav][org-caldav]] (probably the latter)
+ [ ] org-variable-pitch
+ [X] org-re-reveal (export reveal.js presentations from org) =+present=
+ [ ] org-elp (preview latex expressions while editing)
+ [ ] [[https://github.com/Fuco1/org-timeline/][org-timeline]]
+ [ ] [[https://spwhitton.name/tech/code/org-d20/][org-d20]] for dungeonmasters
+ [ ] [[https://github.com/stardiviner/org-tag-beautify][org-tag-beautify]] requires org-pretty-tags (conflicts with =+pretty=?)
+ [ ] org-working-set (manage a working set of nodes)
+ [X] org-present & org-re-reveal
+ from HaoZeke
  - [ ] [[https://gitlab.com/phillord/org-drill/][org-drill]] (use org mode for spaced repitition)
  - [ ] org-protocol?
  - [ ] org-ref (highly recommended)
  - [ ] helm-org-rifle (not worth the helm)
  - [ ] org-async
+ [ ] elegant-agenda-mode

**** org-babel
+ [ ] ob-clojurescript
+ [ ] ob-diagram (generate [[http://projects.haskell.org/diagrams/][diagrams]] using haskell tool)


**** TODO setup org-export-async-init-file (see [[https://dotdoom.rgoswami.me/config.html][1.2.3 Async Exports]])

** LANG :lang:

*** ELISP :elisp:
**** TODO configure eldoc



*** LATEX :latex:

(From Hsin Haoyu) Apparently, [[https://mirror.aarnet.edu.au/pub/CTAN/systems/knuth/dist/tex/tex.web][the TeX source code]] was written in Pascal/TeX was
literate programming code written by Knuth in Pascal/TeX.

*** CLOJURE :clojure:

+ [[https://github.com/pesterhazy/zprint-mode.el][zprint-mode]]

#+begin_src emacs-lisp :tangle ./packages.el
(package! zprint-mode)
#+end_src

#+begin_src emacs-lisp
(add-hook 'clojure-mode-hook 'zprint-mode)
(add-hook 'clojurescript-mode-hook 'zprint-mode)

#+end_src

**** LSP :lsp:
***** TODO follow [[https://emacs-lsp.github.io/lsp-mode/tutorials/clojure-guide/][this guide]]
**** TODO aggressive indent (luca)
**** TODO smartparens/lispyparens (luca)

**** TODO explore packages: [0/5]
+ [ ] cider-eval-sexp-fu
+ [ ] [[https://github.com/plexus/walkclj][walkclj]]
+ [ ] 4clojure
+ [ ] [[https://github.com/didibus/anakondo][anakondo]] (or flycheck/make clj-kondo)
+ [ ] ivy-clojuredocs
  - just pick a key for docs...
  - =C-c s c= (apropos à +lookup)
+ [ ] clojure-mode-extra-font-locking (cider)
+ [ ] ivy-clojuredocs
+ [ ] clojure-snippets
+ [ ] clojars
+ [X] clj-refactor
+ [ ] clj-decompile
+ [ ] cljr-ivy
+ [ ] walkclj (manipulate clojure parse trees)
+ [ ] tree-sitter clojure
+ [ ] hiccup-cli (HTML-to-hiccup ... does this not already exist in clojure?)
+ [ ] org-babel-eval-in-repl
+ [ ] eval-in-relp
+ [ ] clojure-essential-ref
+ [ ] clojure-essential-ref-nov
+ [ ] cider-hydra ?
+ [ ] kaocha-runner (running Fulcro's kaocha tests via CIDER)

*** CIDER

#+begin_src emacs-lisp :tangle ./packages.el
(add-hook 'cider-mode-hook #'clj-refactor-mode)

(setq org-babel-clojure-backend 'cider)
#+end_src

**** CIDER tips:
+ Discover cider commands with =C-c C-x x= from within CIDER.
+ An idea from SLIME, cider shortcuts can be accessed via =,= (comma)

**** TODO decide on the following CIDER variables :cider:
+ nrepl-hide-special-buffer t
+ cider-repl-clear-help-banner
+ cider-font-lock-dynamically nil
+ cider-popup-stacktraces nil
+ cider-repl-popup-stacktraces t
+ cider-repl-use-pretty-printing t
+ cider-repl-pop-to-buffer-on-connect t
+ cider-repl-display-help-banner nil
+ [[file:~/.emacs.d/modules/lang/clojure/config.el][Doom Defaults]]

*** JULIA :julia:

Requires using a =:session= variable to track the results/evaluations of blocks

#+begin_src emacs-lisp :tangle ./packages.el
(package! julia-vterm)
(package! ob-julia-vterm)
#+end_src

#+begin_src emacs-lisp
;; TODO: (after! org & julia-vterm?
;;;         ...)
;; (after! org-babel ... )
;; (org-babel-make-language-alias "julia" "julia-vterm")
#+end_src

#+RESULTS:

**** TODO configure julia (and decide on eglot) [1/2]
+ [X] decide on [[https://github.com/shg/ob-julia-vterm.el][ob-julia-vterm]] or [[https://github.com/frederic-santos/ob-ess-julia][ob-ess-julia]]
+ [ ] [[https://github.com/gcv/julia-snail][julia-snail]]?
**** TODO configure org-babel for julia

**** TODO change the default environment for LSP julia
+ ~(setq lsp-julia-default-environment ~/.julia/environments/v1.0")~

*** PLANTUML :plantuml:

Plant UML is also supported by org-babel

*** KDE :kde:

*** QT :qt:

*** C++ :cpp:

**** TODO cmake-font-lock (type-aware highlighting for cmake scripts)

**** Doxygen Support

#+begin_src emacs-lisp :tangle ./packages.el
(package! highlight-doxygen)
#+end_src

Doxygen for c/cpp [fn:haozeke]

#+begin_src emacs-lisp
(use-package! highlight-doxygen
  :hook ((c-mode c++-mode) . highlight-doxygen-mode))
#+end_src

**** More Files
#+begin_src emacs-lisp
;; from HaoZeke/dotdoom
(setq auto-mode-alist (append '(
                                ("\\.C$" . c++-mode)
                                ("\\.cc$" . c++-mode)
                                ("\\.cpp$" . c++-mode)
                                ("\\.inl$" . c++-mode)
                                ("\\.H$" . c++-mode)
                                ("\\.hh$" . c++-mode)
                                ("\\.hpp$" . c++-mode)
                                )
                              auto-mode-alist))
#+end_src

*** OPEN API :swagger:

#+begin_src emacs-lisp :tangle ./packages.el
(package! openapi-yaml-mode
  :recipe (:host github :repo "esc-emacs/openapi-yaml-mode"))
#+end_src

#+begin_src emacs-lisp
(use-package! openapi-yaml-mode)
#+end_src

**** TODO test openapi-yaml-mode (should apply to files starting with =openapi-yaml-*.yaml=) :testpackage:

*** RESTCLIENT :rest:

Doom =restclient= module includes [[https://github.com/pashky/restclient.el][restclient]] and [[https://github.com/iquiw/company-restclient][company-restclient]]. The =org=
module includes =ob-restclient=. These modes apply to =*.http= files.

**** Test =ob-restclient=:

#+begin_src restclient :tangle no
GET https://google.com/robots.txt
#+end_src

*** GRAPHQL :graphql:

+ [[https://github.com/vermiculus/graphql.el][graphql]]
+ [[https://github.com/davazp/graphql-mode][graphql-mode]]
+ [[https://github.com/jdormit/ob-graphql][ob-graphql]]

#+begin_src emacs-lisp :tangle ./packages.el
(package! graphql)
(package! graphql-mode)
(package! ob-graphql)
#+end_src

#+begin_src emacs-lisp
(use-package! graphql)
(use-package! graphql-mode)
(use-package ob-graphql)
#+end_src

**** Test =ob-graphql=:

#+begin_src graphql :tangle no :url https://countries.trevorblades.com
query GetContinents {
  continent(code: "AF") {
    name
    code
  }
}
#+end_src

*** Packages to Evaluate (Languages)

**** Misc
+ [ ] [[https://github.com/ericcrosson/pine-script-mode][pine-script-mode]] Trading View

**** Latex and Writing
+ [ ] [[https://joostkremers.github.io/ebib/][ebib]] bibtex database
+ [ ] xah-math-mode
+ [ ] [[https://github.com/emacs-grammarly/lsp-grammarly][lsp-grammar]]
+ [ ] [[https://github.com/cpitclaudel/biblio.el][biblio]] and biblio-core (browse import bibliographic refs; e.g from arXiv)
+ [ ] writegood-mode & wc-mode
+ [ ] ob-latex-as-png

** BABEL :babel:

+ doom handles most of this stuff in [[file:~/.emacs.d/modules/lang/org/config.el::defun +org-init-babel-lazy-loader-h (][+org-init-babel-lazy-loader-h]]
  - =org-src-lang-modes= maps org-babel keys to modes (=-mode= suffix)
  - =org-babel-load-languages= describes language blocks types permitted to run
  - is the var =org-confirm-babel-evaluate= still in tact?

Load general org-babel config after defining languages

*** TODO ensure this is necessary with =+org-init-babel-lazy-loader-h=

#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-babel-load-languages
               '((julia-vterm . t)
                 (clojure . t)))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))
;;(defalias 'org-babel-execute:julia 'org-babel-execute:julia-vterm)
#+end_src

*** ob-async

doesn't support session (see tecosaur's notes)

*** [[https://github.com/krisajenkins/ob-translate][ob-translate]]

For someone who owns a ton of original langauge and interlinear/bilingual books,
getting this into org-mode would be super helpfu. It's way more efficient than
manually writing down the translations and the results are searchable. Finally,
perhaps I can make meaningfull progress on that Español copy of Borges'
collections or my italian copy of Foucault's Pendulum -- both of which are far
superior when the etymological connections are left in tact.

#+begin_src emacs-lisp :tangle ./packages.el
(package! google-translate)
(package! ob-translate)
#+end_src

Config google-translate.el ([[https://github.com/atykhonov/google-translate/issues/137][fix for TKK errors]])

#+begin_src emacs-lisp
(use-package! google-translate :demand t
  :init (require 'google-translate)
  :functions (my-google-translate-at-point google-translate--search-tkk)
  :custom (google-translate-backend-method 'curl)
  :config
  (defun google-translate--search-tkk ()
    "Search TKK."
    (list 430675 2721866130))
  (defun my-google-translate-at-point ()
    "reverse translate if prefix"
    (interactive)
    (if current-prefix-arg
        (google-translate-at-point)
      (google-translate-at-point-reverse)))
  :bind
  ;;("C-T". my-google-translate-at-point)
)
#+end_src

**** Test =ob-translate=:

Example:

#+BEGIN_SRC translate :src en :dest de,fr,ar,ja :results output :tangle no
This is a test.
#+END_SRC

#+RESULTS:
| de | Das ist ein Test.  |
| fr | C'est un test.     |
| ar | هذا اختبار.        |
| ja | これはテストです。 |

#+begin_src translate :src en :dest ja :results output :tangle no
Extra Sensory Perception
#+end_src

#+RESULTS:
: 超感覚的知覚

**** TODO emacs support for surfing etymology in wiktionary

** EMAIL :email:

** APP :app:

*** Packages to Evaluate (App)

**** IRC
+ [ ] [[https://github.com/jorgenschaefer/circe][circe]] an IRC client, complexity is "between rcirc and ERC"

** CONFIG :config:

Misc config goes here

*** Prism.el

#+begin_src emacs-lisp :tangle ./packages.el
(package! prism)
#+end_src

Use doom colors for theme and toggle with =:leader tP=

#+begin_src emacs-lisp
(use-package! prism
  :hook ((emacs-lisp-mode . prism-mode)
         (clojure-mode . prism-mode)
         (clojurescript-mode . prism-mode))
  :config (map! :leader :desc "Toggle Prism"
                "tP" (lambda () (interactive) (prism-mode 'toggle)))

  (prism-set-colors :lightens '(0 5 10) :desaturations '(-2.5 0 2.5)
    :colors (-map #'doom-color
                  '(red teal green magenta cyan blue orange dark-cyan violet yellow)))
                  ;; options: red orange green teal yellow blue dark blue magenta violet cyan dark cyan
  )
#+end_src

