packages.el

(package! zprint-mode)

(package! julia-vterm)
(package! ob-julia-vterm)

(package! highlight-doxygen)

(package! google-translate)
(package! ob-translate)

(package! prism)
